app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'SidathPeiris' LIMIT 1
---
  def create
    email_or_username = params[:login][:email_or_username]
    password = params[:login][:password]

    # Try to find user by email or username
    user = User.find_by(email: email_or_username) || User.find_by(username: email_or_username)